In [18]:
#import data
#in this block we are loading in the data by using the open json method.
#start by importing pandas as pd
import pandas as pd
#read in your file
df = pd.read_csv('number-species-threatened/number-species-threatened.csv')
#show the file
df

                 Entity  Code  Year  Number of threatened species
0            All groups   NaN  2024                         46337
1     All invertebrates   NaN  2024                          6432
2            All plants   NaN  2024                         28159
3       All vertebrates   NaN  2024                         11400
4            Amphibians   NaN  2024                          2873
5             Arachnids   NaN  2024                           283
6                 Birds   NaN  2024                          1311
7           Brown algae   NaN  2024                             6
8                Corals   NaN  2024                           334
9           Crustaceans   NaN  2024                           748
10     Ferns and allies   NaN  2024                           322
11               Fishes   NaN  2024                          4017
12     Flowering plants   NaN  2024                         27197
13          Green algae   NaN  2024                             0
14          Gymnosperms   NaN  2024                           450
15      Horseshoe Crabs   NaN  2024                             2
16              Insects   NaN  2024                          2423
17              Mammals   NaN  2024                          1354
18             Molluscs   NaN  2024                          2456
19               Mosses   NaN  2024                           181
20            Mushrooms   NaN  2024                           340
21  Other invertebrates   NaN  2024                           177
22            Red algae   NaN  2024                             9
23             Reptiles   NaN  2024                          1845
24          Total fungi   NaN  2024                           346
25         Velvet Worms   NaN  2024                             9

In [71]:
#delete the code column as it provides no value
df = del(df['Code'])

SyntaxError: invalid syntax (929185079.py, line 2)

In [51]:
#df_clean= df.iloc[0,1,2,3] #these just sum up a lot of our data

In [52]:
#import seaborn so we can make our data visualizations
import seaborn as sns

In [53]:
#histogram to show what species has the highest population out of our data holistically
#sns.histplot(df ['Entity'])

#this graph sucks

In [54]:
#we need to remove the first 4 columns (columns 0-3)
#all species is just reiterating the data by giving us a sum

In [66]:
#clean the data some more so we can refine our graph
clean_df = df.drop([0,1,2,3,5,7,13,18,19,16,20,21,22,24,25])
clean_df = clean_df.reset_index(drop = True)

clean_df

              Entity  Year  Number of threatened species
0         Amphibians  2024                          2873
1              Birds  2024                          1311
2             Corals  2024                           334
3        Crustaceans  2024                           748
4   Ferns and allies  2024                           322
5             Fishes  2024                          4017
6   Flowering plants  2024                         27197
7        Gymnosperms  2024                           450
8    Horseshoe Crabs  2024                             2
9            Mammals  2024                          1354
10          Reptiles  2024                          1845

In [56]:
#make a dataframe of organisms that are under water species
#adding amphibians and reptiles due to those animals being
#present in both terrains

aquatic_df = clean_df.drop([1,4,5,6,7,9,10])
aquatic_df = aquatic_df.reset_index(drop = True)

aquatic_df

            Entity  Year  Number of threatened species
0       Amphibians  2024                          2873
1           Corals  2024                           334
2      Crustaceans  2024                           748
3  Horseshoe Crabs  2024                             2

In [57]:
#now do the same plants

plants_df = clean_df.drop([0,1,2,3,5, 8,9,10])
plants_df = plants_df.reset_index(drop = True)

plants_df

             Entity  Year  Number of threatened species
0  Ferns and allies  2024                           322
1  Flowering plants  2024                         27197
2       Gymnosperms  2024                           450

In [58]:
#clean_df - used to check my data for cleaning

In [59]:
#land animals dataframe- adding amphibians and reptiles due to those animals being
#present in both terrains
terrestrial_df = clean_df.drop([3,4,5,6,7,8])
terrestrial_df = terrestrial_df.reset_index(drop = True)

terrestrial_df

       Entity  Year  Number of threatened species
0  Amphibians  2024                          2873
1       Birds  2024                          1311
2      Corals  2024                           334
3     Mammals  2024                          1354
4    Reptiles  2024                          1845

In [60]:
#story:

#discovering what types of species are most endagered, and then looking into other sources for
#indications as to why certain species/ populations are more endagered than others.

#discuss findings

#find sources that give more insight for our trends

### analyze the data first and then find sources that can get

In [61]:
#DATA VISUALISATIONS:

In [67]:
import seaborn as sns